In [26]:
import pandas as pd

hr1 = pd.DataFrame({'이름':['a','b'],
                   '부서':['영업','회계'],
                   '직급':['팀장','사원']})

hr2 = pd.DataFrame({'이름':['c','d'],
                   '부서':['영업','인사'],
                   '직급':['사원','팀장']})

In [27]:
pd.concat([hr1,hr2],axis=0,ignore_index=False)

  이름  부서  직급
0  a  영업  팀장
1  b  회계  사원
0  c  영업  사원
1  d  인사  팀장

In [28]:
hr3 = pd.DataFrame({'이름':['e','f'],
                   '부서':['영업','인사'],
                   '급여':[3500,2800]})

pd.concat([hr1,hr3],axis = 0,ignore_index=True)

  이름  부서   직급      급여
0  a  영업   팀장     NaN
1  b  회계   사원     NaN
2  e  영업  NaN  3500.0
3  f  인사  NaN  2800.0

In [29]:
hr4 = pd.Series({0:2500},name = '급여')
pd.concat([hr1,hr4],axis=1)

  이름  부서  직급      급여
0  a  영업  팀장  2500.0
1  b  회계  사원     NaN

In [30]:
hr5 = pd.DataFrame({'급여':[5000,3200,3500]})
pd.concat([hr1,hr5],axis=1)

    이름   부서   직급    급여
0    a   영업   팀장  5000
1    b   회계   사원  3200
2  NaN  NaN  NaN  3500

In [31]:
product = pd.DataFrame({'상품코드':['G1','G2','G3','G4'],
                       '상품명':['우유','감자','빵','치킨']})
product

  상품코드 상품명
0   G1  우유
1   G2  감자
2   G3   빵
3   G4  치킨

In [32]:
sale = pd.DataFrame({'주문번호':[1001,1002,1002,1003,1004],
                       '상품코드':['G4','G3','G1','G3','G5'],
                       '주문수량':[1,4,2,2,3]})
sale

   주문번호 상품코드  주문수량
0  1001   G4     1
1  1002   G3     4
2  1002   G1     2
3  1003   G3     2
4  1004   G5     3

In [33]:
sale.merge(product,on='상품코드',how='inner')

   주문번호 상품코드  주문수량 상품명
0  1001   G4     1  치킨
1  1002   G3     4   빵
2  1003   G3     2   빵
3  1002   G1     2  우유

In [34]:
sale.merge(product,on='상품코드',how='outer',sort=True)

     주문번호 상품코드  주문수량  상품명
0  1002.0   G1   2.0   우유
1     NaN   G2   NaN   감자
2  1002.0   G3   4.0    빵
3  1003.0   G3   2.0    빵
4  1001.0   G4   1.0   치킨
5  1004.0   G5   3.0  NaN

In [35]:
df = pd.DataFrame({'학년':[1,1,1,1,2,2],
                  '성별':['여자','남자','여자','남자','여자','남자'],
                  '학급':['A','A','B','B','C','C'],
                  '점수':[100,94,82,96,85,91]})
df

   학년  성별 학급   점수
0   1  여자  A  100
1   1  남자  A   94
2   1  여자  B   82
3   1  남자  B   96
4   2  여자  C   85
5   2  남자  C   91

In [36]:
df.groupby(by='학년',axis=0).count()

    성별  학급  점수
학년
1    4   4   4
2    2   2   2

In [37]:
df.groupby(by='학년')['점수'].mean()

학년
1    93.0
2    88.0
Name: 점수, dtype: float64

In [38]:
df.groupby(by=['학년','성별']).count()

       학급  점수
학년 성별
1  남자   2   2
   여자   2   2
2  남자   1   1
   여자   1   1

In [39]:
df.groupby(by=['학년','성별'])['점수'].median()

학년  성별
1   남자    95.0
    여자    91.0
2   남자    91.0
    여자    85.0
Name: 점수, dtype: float64

In [40]:
df = df.pivot_table(index=['학년','학급'],
                   columns='성별',
                   values='점수')
df

성별     남자   여자
학년 학급
1  A   94  100
   B   96   82
2  C   91   85

In [41]:
import numpy as np
df.apply(np.sqrt,axis=0)

성별           남자         여자
학년 학급
1  A   9.695360  10.000000
   B   9.797959   9.055385
2  C   9.539392   9.219544

In [42]:
df.apply(np.max,axis=0)

성별
남자     96
여자    100
dtype: int64

In [43]:
df.apply(np.max,axis=1)

학년  학급
1   A     100
    B      96
2   C      91
dtype: int64

In [44]:
def plus_five(val):
    return val+5

df.apply(plus_five,axis=0)

성별      남자   여자
학년 학급
1  A    99  105
   B   101   87
2  C    96   90

In [45]:
df['남자'].map(lambda x: x+5)

학년  학급
1   A      99
    B     101
2   C      96
Name: 남자, dtype: int64

In [46]:
import pandas as pd

landmark = pd.DataFrame({'name':['탄도항','화담숲','첨성대'],
                        'location':['경기 안산시 단원구 선감동 717',
                                   '경기 광주시 도척면 도척윗로 278',
                                   '경북 경주시 인왕동 839']})
landmark

  name             location
0  탄도항   경기 안산시 단원구 선감동 717
1  화담숲  경기 광주시 도척면 도척윗로 278
2  첨성대       경북 경주시 인왕동 839

In [47]:
landmark['location'].str[3:6]

0    안산시
1    광주시
2    경주시
Name: location, dtype: object

In [53]:
landmark['location'].str[-1:-4:-1]

0    717
1    872
2    938
Name: location, dtype: object

In [55]:
landmark['location'].str.split(" ")

0     [경기, 안산시, 단원구, 선감동, 717]
1    [경기, 광주시, 도척면, 도척윗로, 278]
2          [경북, 경주시, 인왕동, 839]
Name: location, dtype: object

In [56]:
landmark['location'].str.split(" ",expand = True)

    0    1    2     3     4
0  경기  안산시  단원구   선감동   717
1  경기  광주시  도척면  도척윗로   278
2  경북  경주시  인왕동   839  None

In [57]:
landmark['loc_1'] = landmark['location'].str.split(" ").str[0]
landmark

  name             location loc_1
0  탄도항   경기 안산시 단원구 선감동 717    경기
1  화담숲  경기 광주시 도척면 도척윗로 278    경기
2  첨성대       경북 경주시 인왕동 839    경북

In [59]:
landmark['location'].str.startswith('경기')

0     True
1     True
2    False
Name: location, dtype: bool

In [60]:
landmark['location'].str.endswith('7')

0     True
1    False
2    False
Name: location, dtype: bool

In [62]:
landmark['location'].str.contains('8')

0    False
1     True
2     True
Name: location, dtype: bool

In [67]:
from datetime import datetime
datetime.today()

datetime.datetime(2023, 9, 19, 11, 10, 23, 706244)

In [68]:
datetime.today().year

2023

In [69]:
datetime.today().day

19

In [70]:
datetime.strptime('2023-01-01 12:12:12','%Y-%m-%d %H:%M:%S')

datetime.datetime(2023, 1, 1, 12, 12, 12)

In [71]:
time = datetime.today()
time.strftime('%Y-%m-%d %H:%M:%S')

'2023-09-19 11:12:20'

In [72]:
from datetime import timedelta
time = datetime.today()
time + timedelta(days=10)

datetime.datetime(2023, 9, 29, 11, 14, 19, 472165)